Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_dual/firmware/src/packs/ATSAMA5D29_DFP/component/pwm.h
/*
 * Component description for PWM
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-11-18T13:40:01Z */
#ifndef _SAMA5D_PWM_COMPONENT_H_
#define _SAMA5D_PWM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PWM                                          */
/* ************************************************************************** */

/* -------- PWM_CMR : (PWM Offset: 0x00) (R/W 32) PWM Channel Mode Register -------- */
#define PWM_CMR_CPRE_Pos                      _UINT32_(0)                                          /* (PWM_CMR) Channel Prescaler Position */
#define PWM_CMR_CPRE_Msk                      (_UINT32_(0xF) << PWM_CMR_CPRE_Pos)                  /* (PWM_CMR) Channel Prescaler Mask */
#define PWM_CMR_CPRE(value)                   (PWM_CMR_CPRE_Msk & (_UINT32_(value) << PWM_CMR_CPRE_Pos)) /* Assigment of value for CPRE in the PWM_CMR register */
#define   PWM_CMR_CPRE_MCK_Val                _UINT32_(0x0)                                        /* (PWM_CMR) Peripheral clock  */
#define   PWM_CMR_CPRE_MCK_DIV_2_Val          _UINT32_(0x1)                                        /* (PWM_CMR) Peripheral clock/2  */
#define   PWM_CMR_CPRE_MCK_DIV_4_Val          _UINT32_(0x2)                                        /* (PWM_CMR) Peripheral clock/4  */
#define   PWM_CMR_CPRE_MCK_DIV_8_Val          _UINT32_(0x3)                                        /* (PWM_CMR) Peripheral clock/8  */
#define   PWM_CMR_CPRE_MCK_DIV_16_Val         _UINT32_(0x4)                                        /* (PWM_CMR) Peripheral clock/16  */
#define   PWM_CMR_CPRE_MCK_DIV_32_Val         _UINT32_(0x5)                                        /* (PWM_CMR) Peripheral clock/32  */
#define   PWM_CMR_CPRE_MCK_DIV_64_Val         _UINT32_(0x6)                                        /* (PWM_CMR) Peripheral clock/64  */
#define   PWM_CMR_CPRE_MCK_DIV_128_Val        _UINT32_(0x7)                                        /* (PWM_CMR) Peripheral clock/128  */
#define   PWM_CMR_CPRE_MCK_DIV_256_Val        _UINT32_(0x8)                                        /* (PWM_CMR) Peripheral clock/256  */
#define   PWM_CMR_CPRE_MCK_DIV_512_Val        _UINT32_(0x9)                                        /* (PWM_CMR) Peripheral clock/512  */
#define   PWM_CMR_CPRE_MCK_DIV_1024_Val       _UINT32_(0xA)                                        /* (PWM_CMR) Peripheral clock/1024  */
#define   PWM_CMR_CPRE_CLKA_Val               _UINT32_(0xB)                                        /* (PWM_CMR) Clock A  */
#define   PWM_CMR_CPRE_CLKB_Val               _UINT32_(0xC)                                        /* (PWM_CMR) Clock B  */
#define PWM_CMR_CPRE_MCK                      (PWM_CMR_CPRE_MCK_Val << PWM_CMR_CPRE_Pos)           /* (PWM_CMR) Peripheral clock Position  */
#define PWM_CMR_CPRE_MCK_DIV_2                (PWM_CMR_CPRE_MCK_DIV_2_Val << PWM_CMR_CPRE_Pos)     /* (PWM_CMR) Peripheral clock/2 Position  */
#define PWM_CMR_CPRE_MCK_DIV_4                (PWM_CMR_CPRE_MCK_DIV_4_Val << PWM_CMR_CPRE_Pos)     /* (PWM_CMR) Peripheral clock/4 Position  */
#define PWM_CMR_CPRE_MCK_DIV_8                (PWM_CMR_CPRE_MCK_DIV_8_Val << PWM_CMR_CPRE_Pos)     /* (PWM_CMR) Peripheral clock/8 Position  */
#define PWM_CMR_CPRE_MCK_DIV_16               (PWM_CMR_CPRE_MCK_DIV_16_Val << PWM_CMR_CPRE_Pos)    /* (PWM_CMR) Peripheral clock/16 Position  */
#define PWM_CMR_CPRE_MCK_DIV_32               (PWM_CMR_CPRE_MCK_DIV_32_Val << PWM_CMR_CPRE_Pos)    /* (PWM_CMR) Peripheral clock/32 Position  */
#define PWM_CMR_CPRE_MCK_DIV_64               (PWM_CMR_CPRE_MCK_DIV_64_Val << PWM_CMR_CPRE_Pos)    /* (PWM_CMR) Peripheral clock/64 Position  */
#define PWM_CMR_CPRE_MCK_DIV_128              (PWM_CMR_CPRE_MCK_DIV_128_Val << PWM_CMR_CPRE_Pos)   /* (PWM_CMR) Peripheral clock/128 Position  */
#define PWM_CMR_CPRE_MCK_DIV_256              (PWM_CMR_CPRE_MCK_DIV_256_Val << PWM_CMR_CPRE_Pos)   /* (PWM_CMR) Peripheral clock/256 Position  */
#define PWM_CMR_CPRE_MCK_DIV_512              (PWM_CMR_CPRE_MCK_DIV_512_Val << PWM_CMR_CPRE_Pos)   /* (PWM_CMR) Peripheral clock/512 Position  */
#define PWM_CMR_CPRE_MCK_DIV_1024             (PWM_CMR_CPRE_MCK_DIV_1024_Val << PWM_CMR_CPRE_Pos)  /* (PWM_CMR) Peripheral clock/1024 Position  */
#define PWM_CMR_CPRE_CLKA                     (PWM_CMR_CPRE_CLKA_Val << PWM_CMR_CPRE_Pos)          /* (PWM_CMR) Clock A Position  */
#define PWM_CMR_CPRE_CLKB                     (PWM_CMR_CPRE_CLKB_Val << PWM_CMR_CPRE_Pos)          /* (PWM_CMR) Clock B Position  */
#define PWM_CMR_CALG_Pos                      _UINT32_(8)                                          /* (PWM_CMR) Channel Alignment Position */
#define PWM_CMR_CALG_Msk                      (_UINT32_(0x1) << PWM_CMR_CALG_Pos)                  /* (PWM_CMR) Channel Alignment Mask */
#define PWM_CMR_CALG(value)                   (PWM_CMR_CALG_Msk & (_UINT32_(value) << PWM_CMR_CALG_Pos)) /* Assigment of value for CALG in the PWM_CMR register */
#define   PWM_CMR_CALG_LEFT_ALIGNED_Val       _UINT32_(0x0)                                        /* (PWM_CMR) Left aligned  */
#define   PWM_CMR_CALG_CENTER_ALIGNED_Val     _UINT32_(0x1)                                        /* (PWM_CMR) Center aligned  */
#define PWM_CMR_CALG_LEFT_ALIGNED             (PWM_CMR_CALG_LEFT_ALIGNED_Val << PWM_CMR_CALG_Pos)  /* (PWM_CMR) Left aligned Position  */
#define PWM_CMR_CALG_CENTER_ALIGNED           (PWM_CMR_CALG_CENTER_ALIGNED_Val << PWM_CMR_CALG_Pos) /* (PWM_CMR) Center aligned Position  */
#define PWM_CMR_CPOL_Pos                      _UINT32_(9)                                          /* (PWM_CMR) Channel Polarity Position */
#define PWM_CMR_CPOL_Msk                      (_UINT32_(0x1) << PWM_CMR_CPOL_Pos)                  /* (PWM_CMR) Channel Polarity Mask */
#define PWM_CMR_CPOL(value)                   (PWM_CMR_CPOL_Msk & (_UINT32_(value) << PWM_CMR_CPOL_Pos)) /* Assigment of value for CPOL in the PWM_CMR register */
#define   PWM_CMR_CPOL_LOW_POLARITY_Val       _UINT32_(0x0)                                        /* (PWM_CMR) Waveform starts at low level  */
#define   PWM_CMR_CPOL_HIGH_POLARITY_Val      _UINT32_(0x1)                                        /* (PWM_CMR) Waveform starts at high level  */
#define PWM_CMR_CPOL_LOW_POLARITY             (PWM_CMR_CPOL_LOW_POLARITY_Val << PWM_CMR_CPOL_Pos)  /* (PWM_CMR) Waveform starts at low level Position  */
#define PWM_CMR_CPOL_HIGH_POLARITY            (PWM_CMR_CPOL_HIGH_POLARITY_Val << PWM_CMR_CPOL_Pos) /* (PWM_CMR) Waveform starts at high level Position  */
#define PWM_CMR_CES_Pos                       _UINT32_(10)                                         /* (PWM_CMR) Counter Event Selection Position */
#define PWM_CMR_CES_Msk                       (_UINT32_(0x1) << PWM_CMR_CES_Pos)                   /* (PWM_CMR) Counter Event Selection Mask */
#define PWM_CMR_CES(value)                    (PWM_CMR_CES_Msk & (_UINT32_(value) << PWM_CMR_CES_Pos)) /* Assigment of value for CES in the PWM_CMR register */
#define   PWM_CMR_CES_SINGLE_EVENT_Val        _UINT32_(0x0)                                        /* (PWM_CMR) At the end of PWM period  */
#define   PWM_CMR_CES_DOUBLE_EVENT_Val        _UINT32_(0x1)                                        /* (PWM_CMR) At half of PWM period AND at the end of PWM period  */
#define PWM_CMR_CES_SINGLE_EVENT              (PWM_CMR_CES_SINGLE_EVENT_Val << PWM_CMR_CES_Pos)    /* (PWM_CMR) At the end of PWM period Position  */
#define PWM_CMR_CES_DOUBLE_EVENT              (PWM_CMR_CES_DOUBLE_EVENT_Val << PWM_CMR_CES_Pos)    /* (PWM_CMR) At half of PWM period AND at the end of PWM period Position  */
#define PWM_CMR_UPDS_Pos                      _UINT32_(11)                                         /* (PWM_CMR) Update Selection Position */
#define PWM_CMR_UPDS_Msk                      (_UINT32_(0x1) << PWM_CMR_UPDS_Pos)                  /* (PWM_CMR) Update Selection Mask */
#define PWM_CMR_UPDS(value)                   (PWM_CMR_UPDS_Msk & (_UINT32_(value) << PWM_CMR_UPDS_Pos)) /* Assigment of value for UPDS in the PWM_CMR register */
#define   PWM_CMR_UPDS_UPDATE_AT_PERIOD_Val   _UINT32_(0x0)                                        /* (PWM_CMR) At the next end of PWM period  */
#define   PWM_CMR_UPDS_UPDATE_AT_HALF_PERIOD_Val _UINT32_(0x1)                                        /* (PWM_CMR) At the next end of Half PWM period  */
#define PWM_CMR_UPDS_UPDATE_AT_PERIOD         (PWM_CMR_UPDS_UPDATE_AT_PERIOD_Val << PWM_CMR_UPDS_Pos) /* (PWM_CMR) At the next end of PWM period Position  */
#define PWM_CMR_UPDS_UPDATE_AT_HALF_PERIOD    (PWM_CMR_UPDS_UPDATE_AT_HALF_PERIOD_Val << PWM_CMR_UPDS_Pos) /* (PWM_CMR) At the next end of Half PWM period Position  */
#define PWM_CMR_DPOLI_Pos                     _UINT32_(12)                                         /* (PWM_CMR) Disabled Polarity Inverted Position */
#define PWM_CMR_DPOLI_Msk                     (_UINT32_(0x1) << PWM_CMR_DPOLI_Pos)                 /* (PWM_CMR) Disabled Polarity Inverted Mask */
#define PWM_CMR_DPOLI(value)                  (PWM_CMR_DPOLI_Msk & (_UINT32_(value) << PWM_CMR_DPOLI_Pos)) /* Assigment of value for DPOLI in the PWM_CMR register */
#define PWM_CMR_TCTS_Pos                      _UINT32_(13)                                         /* (PWM_CMR) Timer Counter Trigger Selection Position */
#define PWM_CMR_TCTS_Msk                      (_UINT32_(0x1) << PWM_CMR_TCTS_Pos)                  /* (PWM_CMR) Timer Counter Trigger Selection Mask */
#define PWM_CMR_TCTS(value)                   (PWM_CMR_TCTS_Msk & (_UINT32_(value) << PWM_CMR_TCTS_Pos)) /* Assigment of value for TCTS in the PWM_CMR register */
#define PWM_CMR_DTE_Pos                       _UINT32_(16)                                         /* (PWM_CMR) Dead-Time Generator Enable Position */
#define PWM_CMR_DTE_Msk                       (_UINT32_(0x1) << PWM_CMR_DTE_Pos)                   /* (PWM_CMR) Dead-Time Generator Enable Mask */
#define PWM_CMR_DTE(value)                    (PWM_CMR_DTE_Msk & (_UINT32_(value) << PWM_CMR_DTE_Pos)) /* Assigment of value for DTE in the PWM_CMR register */
#define PWM_CMR_DTHI_Pos                      _UINT32_(17)                                         /* (PWM_CMR) Dead-Time PWMHx Output Inverted Position */
#define PWM_CMR_DTHI_Msk                      (_UINT32_(0x1) << PWM_CMR_DTHI_Pos)                  /* (PWM_CMR) Dead-Time PWMHx Output Inverted Mask */
#define PWM_CMR_DTHI(value)                   (PWM_CMR_DTHI_Msk & (_UINT32_(value) << PWM_CMR_DTHI_Pos)) /* Assigment of value for DTHI in the PWM_CMR register */
#define PWM_CMR_DTLI_Pos                      _UINT32_(18)                                         /* (PWM_CMR) Dead-Time PWMLx Output Inverted Position */
#define PWM_CMR_DTLI_Msk                      (_UINT32_(0x1) << PWM_CMR_DTLI_Pos)                  /* (PWM_CMR) Dead-Time PWMLx Output Inverted Mask */
#define PWM_CMR_DTLI(value)                   (PWM_CMR_DTLI_Msk & (_UINT32_(value) << PWM_CMR_DTLI_Pos)) /* Assigment of value for DTLI in the PWM_CMR register */
#define PWM_CMR_PPM_Pos                       _UINT32_(19)                                         /* (PWM_CMR) Push-Pull Mode Position */
#define PWM_CMR_PPM_Msk                       (_UINT32_(0x1) << PWM_CMR_PPM_Pos)                   /* (PWM_CMR) Push-Pull Mode Mask */
#define PWM_CMR_PPM(value)                    (PWM_CMR_PPM_Msk & (_UINT32_(value) << PWM_CMR_PPM_Pos)) /* Assigment of value for PPM in the PWM_CMR register */
#define PWM_CMR_Msk                           _UINT32_(0x000F3F0F)                                 /* (PWM_CMR) Register Mask  */


