Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_dual/firmware/src/packs/ATSAMA5D29_DFP/component/pwm.h
#define PWM_IMR2_CMPM_Pos                     _UINT32_(8)                                          /* (PWM_IMR2 Position) Comparison x Match Interrupt Mask */
#define PWM_IMR2_CMPM_Msk                     (_UINT32_(0xFF) << PWM_IMR2_CMPM_Pos)                /* (PWM_IMR2 Mask) CMPM */
#define PWM_IMR2_CMPM(value)                  (PWM_IMR2_CMPM_Msk & (_UINT32_(value) << PWM_IMR2_CMPM_Pos)) 
#define PWM_IMR2_CMPU_Pos                     _UINT32_(16)                                         /* (PWM_IMR2 Position) Comparison 7 Update Interrupt Mask */
#define PWM_IMR2_CMPU_Msk                     (_UINT32_(0xFF) << PWM_IMR2_CMPU_Pos)                /* (PWM_IMR2 Mask) CMPU */
#define PWM_IMR2_CMPU(value)                  (PWM_IMR2_CMPU_Msk & (_UINT32_(value) << PWM_IMR2_CMPU_Pos)) 

/* -------- PWM_ISR2 : (PWM Offset: 0x40) ( R/ 32) PWM Interrupt Status Register 2 -------- */
#define PWM_ISR2_WRDY_Pos                     _UINT32_(0)                                          /* (PWM_ISR2) Write Ready for Synchronous Channels Update Position */
#define PWM_ISR2_WRDY_Msk                     (_UINT32_(0x1) << PWM_ISR2_WRDY_Pos)                 /* (PWM_ISR2) Write Ready for Synchronous Channels Update Mask */
#define PWM_ISR2_WRDY(value)                  (PWM_ISR2_WRDY_Msk & (_UINT32_(value) << PWM_ISR2_WRDY_Pos)) /* Assigment of value for WRDY in the PWM_ISR2 register */
#define PWM_ISR2_UNRE_Pos                     _UINT32_(3)                                          /* (PWM_ISR2) Synchronous Channels Update Underrun Error Position */
#define PWM_ISR2_UNRE_Msk                     (_UINT32_(0x1) << PWM_ISR2_UNRE_Pos)                 /* (PWM_ISR2) Synchronous Channels Update Underrun Error Mask */
#define PWM_ISR2_UNRE(value)                  (PWM_ISR2_UNRE_Msk & (_UINT32_(value) << PWM_ISR2_UNRE_Pos)) /* Assigment of value for UNRE in the PWM_ISR2 register */
#define PWM_ISR2_CMPM0_Pos                    _UINT32_(8)                                          /* (PWM_ISR2) Comparison 0 Match Position */
#define PWM_ISR2_CMPM0_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM0_Pos)                /* (PWM_ISR2) Comparison 0 Match Mask */
#define PWM_ISR2_CMPM0(value)                 (PWM_ISR2_CMPM0_Msk & (_UINT32_(value) << PWM_ISR2_CMPM0_Pos)) /* Assigment of value for CMPM0 in the PWM_ISR2 register */
#define PWM_ISR2_CMPM1_Pos                    _UINT32_(9)                                          /* (PWM_ISR2) Comparison 1 Match Position */
#define PWM_ISR2_CMPM1_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM1_Pos)                /* (PWM_ISR2) Comparison 1 Match Mask */
#define PWM_ISR2_CMPM1(value)                 (PWM_ISR2_CMPM1_Msk & (_UINT32_(value) << PWM_ISR2_CMPM1_Pos)) /* Assigment of value for CMPM1 in the PWM_ISR2 register */
#define PWM_ISR2_CMPM2_Pos                    _UINT32_(10)                                         /* (PWM_ISR2) Comparison 2 Match Position */
#define PWM_ISR2_CMPM2_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM2_Pos)                /* (PWM_ISR2) Comparison 2 Match Mask */
#define PWM_ISR2_CMPM2(value)                 (PWM_ISR2_CMPM2_Msk & (_UINT32_(value) << PWM_ISR2_CMPM2_Pos)) /* Assigment of value for CMPM2 in the PWM_ISR2 register */
#define PWM_ISR2_CMPM3_Pos                    _UINT32_(11)                                         /* (PWM_ISR2) Comparison 3 Match Position */
#define PWM_ISR2_CMPM3_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM3_Pos)                /* (PWM_ISR2) Comparison 3 Match Mask */
#define PWM_ISR2_CMPM3(value)                 (PWM_ISR2_CMPM3_Msk & (_UINT32_(value) << PWM_ISR2_CMPM3_Pos)) /* Assigment of value for CMPM3 in the PWM_ISR2 register */
#define PWM_ISR2_CMPM4_Pos                    _UINT32_(12)                                         /* (PWM_ISR2) Comparison 4 Match Position */
#define PWM_ISR2_CMPM4_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM4_Pos)                /* (PWM_ISR2) Comparison 4 Match Mask */
#define PWM_ISR2_CMPM4(value)                 (PWM_ISR2_CMPM4_Msk & (_UINT32_(value) << PWM_ISR2_CMPM4_Pos)) /* Assigment of value for CMPM4 in the PWM_ISR2 register */
#define PWM_ISR2_CMPM5_Pos                    _UINT32_(13)                                         /* (PWM_ISR2) Comparison 5 Match Position */
#define PWM_ISR2_CMPM5_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM5_Pos)                /* (PWM_ISR2) Comparison 5 Match Mask */
#define PWM_ISR2_CMPM5(value)                 (PWM_ISR2_CMPM5_Msk & (_UINT32_(value) << PWM_ISR2_CMPM5_Pos)) /* Assigment of value for CMPM5 in the PWM_ISR2 register */
#define PWM_ISR2_CMPM6_Pos                    _UINT32_(14)                                         /* (PWM_ISR2) Comparison 6 Match Position */
#define PWM_ISR2_CMPM6_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM6_Pos)                /* (PWM_ISR2) Comparison 6 Match Mask */
#define PWM_ISR2_CMPM6(value)                 (PWM_ISR2_CMPM6_Msk & (_UINT32_(value) << PWM_ISR2_CMPM6_Pos)) /* Assigment of value for CMPM6 in the PWM_ISR2 register */
#define PWM_ISR2_CMPM7_Pos                    _UINT32_(15)                                         /* (PWM_ISR2) Comparison 7 Match Position */
#define PWM_ISR2_CMPM7_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPM7_Pos)                /* (PWM_ISR2) Comparison 7 Match Mask */
#define PWM_ISR2_CMPM7(value)                 (PWM_ISR2_CMPM7_Msk & (_UINT32_(value) << PWM_ISR2_CMPM7_Pos)) /* Assigment of value for CMPM7 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU0_Pos                    _UINT32_(16)                                         /* (PWM_ISR2) Comparison 0 Update Position */
#define PWM_ISR2_CMPU0_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU0_Pos)                /* (PWM_ISR2) Comparison 0 Update Mask */
#define PWM_ISR2_CMPU0(value)                 (PWM_ISR2_CMPU0_Msk & (_UINT32_(value) << PWM_ISR2_CMPU0_Pos)) /* Assigment of value for CMPU0 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU1_Pos                    _UINT32_(17)                                         /* (PWM_ISR2) Comparison 1 Update Position */
#define PWM_ISR2_CMPU1_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU1_Pos)                /* (PWM_ISR2) Comparison 1 Update Mask */
#define PWM_ISR2_CMPU1(value)                 (PWM_ISR2_CMPU1_Msk & (_UINT32_(value) << PWM_ISR2_CMPU1_Pos)) /* Assigment of value for CMPU1 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU2_Pos                    _UINT32_(18)                                         /* (PWM_ISR2) Comparison 2 Update Position */
#define PWM_ISR2_CMPU2_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU2_Pos)                /* (PWM_ISR2) Comparison 2 Update Mask */
#define PWM_ISR2_CMPU2(value)                 (PWM_ISR2_CMPU2_Msk & (_UINT32_(value) << PWM_ISR2_CMPU2_Pos)) /* Assigment of value for CMPU2 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU3_Pos                    _UINT32_(19)                                         /* (PWM_ISR2) Comparison 3 Update Position */
#define PWM_ISR2_CMPU3_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU3_Pos)                /* (PWM_ISR2) Comparison 3 Update Mask */
#define PWM_ISR2_CMPU3(value)                 (PWM_ISR2_CMPU3_Msk & (_UINT32_(value) << PWM_ISR2_CMPU3_Pos)) /* Assigment of value for CMPU3 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU4_Pos                    _UINT32_(20)                                         /* (PWM_ISR2) Comparison 4 Update Position */
#define PWM_ISR2_CMPU4_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU4_Pos)                /* (PWM_ISR2) Comparison 4 Update Mask */
#define PWM_ISR2_CMPU4(value)                 (PWM_ISR2_CMPU4_Msk & (_UINT32_(value) << PWM_ISR2_CMPU4_Pos)) /* Assigment of value for CMPU4 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU5_Pos                    _UINT32_(21)                                         /* (PWM_ISR2) Comparison 5 Update Position */
#define PWM_ISR2_CMPU5_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU5_Pos)                /* (PWM_ISR2) Comparison 5 Update Mask */
#define PWM_ISR2_CMPU5(value)                 (PWM_ISR2_CMPU5_Msk & (_UINT32_(value) << PWM_ISR2_CMPU5_Pos)) /* Assigment of value for CMPU5 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU6_Pos                    _UINT32_(22)                                         /* (PWM_ISR2) Comparison 6 Update Position */
#define PWM_ISR2_CMPU6_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU6_Pos)                /* (PWM_ISR2) Comparison 6 Update Mask */
#define PWM_ISR2_CMPU6(value)                 (PWM_ISR2_CMPU6_Msk & (_UINT32_(value) << PWM_ISR2_CMPU6_Pos)) /* Assigment of value for CMPU6 in the PWM_ISR2 register */
#define PWM_ISR2_CMPU7_Pos                    _UINT32_(23)                                         /* (PWM_ISR2) Comparison 7 Update Position */
#define PWM_ISR2_CMPU7_Msk                    (_UINT32_(0x1) << PWM_ISR2_CMPU7_Pos)                /* (PWM_ISR2) Comparison 7 Update Mask */
#define PWM_ISR2_CMPU7(value)                 (PWM_ISR2_CMPU7_Msk & (_UINT32_(value) << PWM_ISR2_CMPU7_Pos)) /* Assigment of value for CMPU7 in the PWM_ISR2 register */
#define PWM_ISR2_Msk                          _UINT32_(0x00FFFF09)                                 /* (PWM_ISR2) Register Mask  */

